/* Задача 1
Маємо змінну min = 20
Якщо min попадає в першу чверть години - вивести на консоль "перша чверть".
Якщо min попадає в другу чверть години - вивести на консоль "друга чверть".
Якщо min попадає в третю чверть години - вивести на консоль "третя чверть".
Якщо min попадає в четверту чверть години - вивести на консоль "четверта чверть".*/

let min = 20;
if (min < 15) {
    console.log('Перша чверть');
} else if (min >= 15 && min < 30) {
    console.log('Друга чверть');
} else if (min >= 30 && min < 45) {
    console.log('Третя чверть');
} else if (min >= 45 && min < 60) {
    console.log('Четверта чверть');
} else {
    console.log('Невідоме значення');
}


/* Задача 2
Дано два числа. Виведіть найбільше з цих чисел. 
Примітка. Створіть дві змінні, проініціалізуйте їх та порівняйте числа. Виведіть результат. */

const num1 = 5;
const num2 = 10;
if (num1 > num2) {
    console.log(num1 + ' більше ' + num2);
} else {
    console.log(num2 + ' більше ' + num1);
}


/* Задача 3
Потрібно визначити, чи цей рік є високосним. 
Примітка. Рік є високосним, якщо його номер кратний 4, але не кратний 100, 
а також якщо він кратний 400. */

const year = 2100;
if ((year % 4 === 0) && (year % 100 != 0) || (year % 400 === 0)) {
    console.log('Рік високосний');
} else {
    console.log('Рік НЕ високосний');
}


/* Задача 4
У вас є задане початкове і кінцеве значення діапазону, а також певне число. 
Вам потрібно визначити, чи входить це число в заданий діапазон. 
Якщо число знаходиться між початковим і кінцевим значеннями діапазону (включно), 
вивести "В діапазоні". 
В іншому випадку вивести "Поза діапазоном", оскільки число знаходиться поза 
початковим і кінцевим значеннями.*/

const rangeStart = 0;
const rangeEnd = 100;
let num3 = 101;
if (num3 >= rangeStart && num3 <= rangeEnd) {
    console.log(num3 + ' в діапазоні від нуля до ста');
} else {
    console.log(num3 + ' не в діапазоні від нуля до ста');
}

/* Задача 5 (*)
Козак Вус проводить змагання з програмування, в якому беруть участь n людей. 
Він вирішив нагородити їх усіх ручками та блокнотами. 
Відомо, що Ус має рівно m ручок і k блокнотів.
Визначте, чи може Козак нагородити всіх учасників, даючи кожному з них щонайменше 
по одній ручці та як мінімум по одному блокноту.*/

const n = 40;
const m = 50;
const i = 20;
if (m / n >= 1 && i / n >= 1) {
    console.log('Козак Вус нагороджує всіх учасників змагань ручками та блокнотами!');
} else {
    console.log('Козак Вус усно дякує всім учасникам змагань');
}


/* Задача 6 (**)
Ви є організатором розважальної програми і вам потрібно розподілити вхідні квитки 
на основі віку відвідувачів. 
Вхідні квитки мають різні ціни в залежності від віку відвідувачів. 
Вам потрібно реалізувати таку логіку, яка в залежності від віку відвідувача повертає 
вартість його квитка згідно наступних умов:

- Діти до 6 років: безкоштовний вхід
- Діти від 6 до 12 років (включно): квиток коштує $10
- Дорослі від 12 років і старше: квиток коштує $20

Якщо дорослий надає документ, що підтверджує його право на пільги, то такому дорослому 
надається знижка 50% (знижка для всіх дорослих фіксована, незалежно від виду пільги).*/

let age;
let discount;
let ticket;

age = 19;
discount = true;
if (age < 6) {
    ticket = 0;
} 
else if (age >= 6 && age < 12) {
    ticket = 10;
}
else if (age >= 12 && discount == false) {
    ticket = 20;
}
else if (age >= 12 && discount) {
    ticket = 10;
}
console.log('Вартість квитка ' + ticket + '$');
